{
  "title": "Klearxos Xlioumphs - Software Developer",
  "heroTitle": "Klearxos Xlioumphs",
  "heroSubtitle": "Motivated Software Developer | Android & Kotlin Specialist",
  "githubButton": "View My GitHub",
  "summaryTitle": "Summary",
  "summaryText": "Motivated Software Developer, currently in my first year of a two-year Backend Development program at <strong>IEK DELTA 360</strong>. With a strong foundation and hands-on experience in Kotlin and Android development, I am eager to contribute to real-world projects, grow within a collaborative team, and build scalable, clean coding solutions.",
  "motivationTitle": "My Motivation",
  "motivationText": "I chose programming out of a deep passion for problem-solving and creation. The ability to transform an abstract idea into a tangible, functional application is incredibly rewarding. My focus shifted specifically to <strong>Android Development</strong> because of its direct impact on millions of users' daily lives. I am driven by the challenge of creating intuitive, high-performance mobile experiences on a platform that is constantly evolving, using powerful languages like Kotlin to write clean and efficient code.",
  "skillsTitle": "Skills",
  "projectsTitle": "Featured Projects",
  "pharmacySubtitle": "Modern Android App for On-Duty Pharmacies",
  "pharmacyDescription": "A native Android application designed to help users instantly locate on-duty pharmacies. The app is built on a modern tech stack with a focus on clean architecture and a fluid, responsive user interface. It serves as a practical tool for everyday use, demonstrating skills in mobile development, real-time data handling, and user-centric design.",
  "pharmacyKeyFeatures": "Key Features & Contributions:",
  "pharmacyFeature1": "Developed a fluid and intuitive UI from scratch using Jetpack Compose.",
  "pharmacyFeature2": "Implemented a clean MVVM architecture for a scalable and maintainable codebase.",
  "pharmacyFeature3": "Integrated Firebase & Firestore for real-time data synchronization.",
  "pharmacyFeature4": "Added full multilingual support for both English and Greek.",
  "pharmacyFeature5": "Engineered a dynamic theme system for a seamless light/dark mode experience.",
  "nexusSubtitle": "AI Co-Pilot for Unreal Engine 5",
  "nexusDescription": "Context Nexus is a professional, in-editor C++ plugin that acts as an expert pair programmer for Unreal developers. It solves the critical problem of context repetition by performing a deep analysis of a project's C++ and Blueprint source code, allowing developers to ask complex questions to an AI that has a perfect, minimal, and relevant understanding of their work.",
  "nexusKeyFeatures": "Key Contributions & Responsibilities:",
  "nexusFeatureFull1": "Developed and enhanced the core C++ analysis engine, enabling the tool to parse and understand a project's entire C++ source code.",
  "nexusFeatureFull2": "Architected and implemented key UI components using the Slate UI framework, including the \"Project Explorer\" and the integrated AI chat panel.",
  "nexusFeatureFull3": "Resolved critical C++ compilation, linker errors, and memory corruption bugs to ensure plugin stability and reliability.",
  "nexusFeatureFull4": "Integrated the plugin directly into the Unreal Editor's Content Browser, creating a seamless workflow for developers.",
  "nexusFeatureFull5": "Enhanced the AI's understanding by implementing semantic analysis of Blueprint graphs and a custom Domain-Specific Language (DSL).",
  "otherProjectsTitle": "Other Projects",
  "contactTitle": "Get In Touch",
  "contactText": "I'm always open to discussing new projects and opportunities.",
  "contactButton": "Email Me",
  "footerRights": "All rights reserved.",
  "viewLiveSite": "View Live Site",
  "viewOnGithub": "View on GitHub"
}
