{
    "title": "Κλέαρχος Χλιούμπης - Software Developer",
    "navSummary": "Περίληψη",
    "navSkills": "Δεξιότητες",
    "navFeatured": "Κύρια Έργα",
    "navOther": "Άλλα Έργα",
    "navResume": "Βιογραφικό",
    "navCertifications": "Πιστοποιήσεις",
    "navContact": "Επικοινωνία",
    "heroTitle": "Κλέαρχος Χλιούμπης",
    "heroSubtitle": "Android Developer & Backend Enthusiast",
    "githubButton": "Προβολή GitHub",
    "summaryTitle": "Περίληψη",
    "summaryText": "Είμαι ένας αφοσιωμένος και παθιασμένος Software Developer, που αυτή τη στιγμή εξελίσσω τις δεξιότητές μου στο πρόγραμμα <strong>Τεχνικός Εφαρμογών Πληροφορικής</strong> του <strong>IEK DELTA 360</strong>. Εστιάζω τόσο στην ανάπτυξη native <strong>Android εφαρμογών</strong> με Kotlin και Jetpack Compose, όσο και στην εμβάθυνση σε <strong>Backend συστήματα</strong>, γεφυρώνοντας το χάσμα ανάμεσα στο user interface και στη στιβαρή λογική του server. Εφαρμόζω με συνέπεια τις αρχές του Agile, δίνοντας προτεραιότητα στη συνεργασία, την ευελιξία και τη συνεχή βελτίωση. Η προσέγγισή μου καθοδηγείται από τη διαρκή μάθηση, την οποία ενισχύω μέσα από προσωπικά projects που με βοηθούν να εξερευνώ νέες τεχνολογίες και να καλλιεργώ τις ικανότητές μου στην επίλυση προβλημάτων. Με κινητοποιεί η πρόκληση να μετατρέπω σύνθετες ιδέες σε κομψό και λειτουργικό λογισμικό, με στόχο να συμβάλλω σε καινοτόμα και ουσιαστικά έργα.",
    "motivationTitle": "Κίνητρο",
    "motivationText": "Η σχέση μου με τον προγραμματισμό ξεκίνησε από την παιδική ηλικία, μέσα από ένα έντονο πάθος για την τεχνολογία και τη δημιουργικότητα. Αυτό που με εμπνέει είναι η ικανοποίηση του να μετατρέπω μια αφηρημένη ιδέα σε μια απτή, διαδραστική εφαρμογή που μπορεί να λύσει προβλήματα, να παρέχει υπηρεσίες ή να προσφέρει μια θετική εμπειρία στον χρήστη. Απολαμβάνω την πνευματική πρόκληση της ανάπτυξης λογισμικού — από τον σχεδιασμό καθαρών και επεκτάσιμων συστημάτων μέχρι τον σχολαστικό εντοπισμό και τη βελτιστοποίηση του κώδικα για μέγιστη απόδοση. Η ενασχόλησή μου με γλώσσες όπως η Kotlin και η Java εδραίωσε το ενδιαφέρον μου, καθώς μου προσφέρουν τα εργαλεία για να υλοποιώ τις εφαρμογές που οραματίζομαι. Τελικά, το κίνητρό μου είναι να αξιοποιώ την τεχνολογία ώστε να δημιουργώ κομψές λύσεις και να συνεισφέρω ουσιαστικά στο συνεχώς εξελισσόμενο ψηφιακό τοπίο.",
    "skillsTitle": "Δεξιότητες & Γνώσεις",
    "skillsSubLanguages": "Γλώσσες & Frameworks",
    "skillsSubIDEs": "Περιβάλλοντα Ανάπτυξης",
    "skillsSubTools": "Εργαλεία",
    "projectsTitle": "Κύρια Έργα",
    "nexusSubtitle": "ContextNexus",
    "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό C++ plugin για το Unreal Editor, που λειτουργεί ως «ειδικός pair programmer». Επιλύει το πρόβλημα της επανάληψης του context με βαθιά ανάλυση του κώδικα C++ και Blueprint ενός project, δίνοντας τη δυνατότητα στους developers να θέτουν σύνθετες ερωτήσεις σε μια AI με ακριβή και σχετική κατανόηση της δουλειάς τους.",
    "nexusKeyFeatures": "Κύριες Συνεισφορές & Ρόλοι:",
    "nexusFeatureFull1": "Ανάπτυξη και βελτίωση της βασικής μηχανής ανάλυσης C++, που επιτρέπει την κατανόηση ολόκληρου του πηγαίου κώδικα ενός project.",
    "nexusFeatureFull2": "Σχεδίαση και υλοποίηση βασικών UI components με το Slate UI framework, όπως το 'Project Explorer' και το ενσωματωμένο AI chat panel.",
    "nexusFeatureFull3": "Επίλυση κρίσιμων σφαλμάτων μεταγλώττισης, linker errors και memory corruption για μέγιστη σταθερότητα.",
    "nexusFeatureFull4": "Ενσωμάτωση του plugin στον Content Browser του Unreal Editor για απρόσκοπτη ροή εργασίας.",
    "nexusFeatureFull5": "Βελτίωση κατανόησης της AI με σημασιολογική ανάλυση των Blueprint graphs και δημιουργία custom DSL.",
    "viewLiveSite": "Δείτε το Site",
    "pharmacyTitle": "E-Efimerevon",
    "pharmacySubtitle": "Σύγχρονη Android Εφαρμογή για Εφημερεύοντα Φαρμακεία",
    "pharmacyDescription": "Μια native Android εφαρμογή που βοηθά τους χρήστες στην Ελλάδα να βρίσκουν εύκολα τα εφημερεύοντα φαρμακεία. Αναπτύχθηκε με Kotlin, Jetpack Compose και Firebase, προσφέροντας γρήγορη, καθαρή και φιλική εμπειρία.",
    "pharmacyKeyFeatures": "Κύρια Χαρακτηριστικά & Συνεισφορές:",
    "pharmacyFeature1": "Σχεδίαση και ανάπτυξη ενός ρευστού και διαισθητικού UI με Jetpack Compose.",
    "pharmacyFeature2": "Υλοποίηση καθαρής MVVM αρχιτεκτονικής για επεκτάσιμο και εύκολα συντηρήσιμο κώδικα.",
    "pharmacyFeature3": "Ενσωμάτωση Firebase & Firestore για συγχρονισμό δεδομένων σε πραγματικό χρόνο.",
    "pharmacyFeature4": "Πλήρης υποστήριξη πολλών γλωσσών (Ελληνικά & Αγγλικά).",
    "pharmacyFeature5": "Δημιουργία δυναμικού συστήματος θεμάτων για light/dark mode.",
    "viewOnGithub": "Δείτε στο GitHub",
    "otherProjectsTitle": "Άλλα Έργα",
    "resumeSectionTitle": "Βιογραφικό",
    "viewResumeBtn": "Προβολή Βιογραφικού",
    "hideResumeBtn": "Απόκρυψη Βιογραφικού",
    "downloadButton": "Λήψη PDF",
    "certificationsTitle": "Πιστοποιήσεις",
    "contactTitle": "Επικοινωνία",
    "contactText": "Είμαι πάντα ανοιχτός σε συζητήσεις για νέες συνεργασίες και ευκαιρίες.",
    "contactButton": "Αποστολή Email",
    "footerRights": "© Όλα τα δικαιώματα διατηρούνται."
}

