{
    "title": "Κλέαρχος Χλιούμπης - Software Developer",
    "navSummary": "Περίληψη",
    "navSkills": "Δεξιότητες",
    "navFeatured": "Κύρια Έργα",
    "navOther": "Άλλα Έργα",
    "navResume": "Βιογραφικό",
    "navContact": "Επικοινωνία",
    "heroTitle": "Κλέαρχος Χλιούμπης",
    "heroSubtitle": "Software Developer | Android & Backend Enthusiast",
    "githubButton": "Δείτε το GitHub μου",
    "summaryTitle": "Περίληψη",
    "summaryText": "Είμαι Software Developer, στο πρώτο έτος του διετούς προγράμματος Backend Development στο <strong>IEK DELTA 360</strong>. Έχω χτίσει γερή βάση στην ανάπτυξη Android με Kotlin και Jetpack Compose και με ενδιαφέρει ιδιαίτερα η δημιουργία αξιόπιστων backend συστημάτων. Μου αρέσει να μαθαίνω νέες τεχνολογίες, να λύνω σύνθετα προβλήματα και να συμβάλλω σε καινοτόμα έργα λογισμικού.",
    "motivationTitle": "Το Κίνητρό μου",
    "motivationText": "Ασχολούμαι με τον προγραμματισμό γιατί με συναρπάζει η επίλυση προβλημάτων και η δημιουργία. Το να μετατρέπω μια ιδέα σε μια λειτουργική εφαρμογή που μπορεί να βοηθήσει ή να ψυχαγωγήσει ανθρώπους είναι αυτό που με εμπνέει. Μου αρέσει η πρόκληση του debugging, της βελτιστοποίησης και της αναζήτησης κομψών λύσεων, ενώ συνεχώς επιδιώκω να εξελίσσω τις γνώσεις και τις δεξιότητές μου στον κόσμο της ανάπτυξης λογισμικού.",
    "skillsTitle": "Δεξιότητες & Ικανότητες",
    "skillsSubLanguages": "Γλώσσες & Frameworks",
    "skillsSubIDEs": "IDEs",
    "skillsSubTools": "Εργαλεία Ανάπτυξης",
    "projectsTitle": "Κύρια Έργα",
    "nexusSubtitle": "ContextNexus",
    "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό C++ plugin μέσα στον editor, που λειτουργεί σαν ειδικός pair programmer για Unreal developers. Λύνει το κρίσιμο πρόβλημα της επανάληψης του context εκτελώντας εις βάθος ανάλυση του C++ και Blueprint κώδικα ενός project, επιτρέποντας στους developers να κάνουν σύνθετες ερωτήσεις σε μια AI που έχει ακριβή και σχετική κατανόηση της δουλειάς τους.",
    "nexusKeyFeatures": "Βασικές Συνεισφορές & Αρμοδιότητες:",
    "nexusFeatureFull1": "Ανάπτυξη και βελτίωση του πυρήνα της μηχανής ανάλυσης C++, δίνοντας τη δυνατότητα στο εργαλείο να κατανοεί ολόκληρο τον πηγαίο κώδικα ενός project.",
    "nexusFeatureFull2": "Σχεδίαση και υλοποίηση βασικών στοιχείων του UI με το Slate UI framework, όπως το 'Project Explorer' και το ενσωματωμένο AI chat panel.",
    "nexusFeatureFull3": "Επίλυση κρίσιμων σφαλμάτων μεταγλώττισης, linker errors και memory corruption για μέγιστη σταθερότητα και αξιοπιστία.",
    "nexusFeatureFull4": "Ενσωμάτωση του plugin απευθείας στον Content Browser του Unreal Editor για απρόσκοπτη ροή εργασίας.",
    "nexusFeatureFull5": "Βελτίωση της κατανόησης της AI μέσω σημασιολογικής ανάλυσης των Blueprint graphs και ανάπτυξη custom Domain-Specific Language (DSL).",
    "viewLiveSite": "Δείτε το Site",
    "pharmacyTitle": "E-Efimerevon",
    "pharmacySubtitle": "Σύγχρονη Android Εφαρμογή για Εφημερεύοντα Φαρμακεία",
    "pharmacyDescription": "Μια native Android εφαρμογή σχεδιασμένη για να λύσει το πρόβλημα της εύρεσης εφημερεύοντων φαρμακείων στην Ελλάδα. Χτισμένη εξ αρχής με σύγχρονη τεχνολογική στοίβα (<strong>Kotlin</strong>, <strong>Jetpack Compose</strong>, <strong>Firebase</strong>), προσφέρει καθαρή, γρήγορη και φιλική εμπειρία χρήσης.",
    "pharmacyKeyFeatures": "Κύριες Συνεισφορές & Τεχνικά Σημεία:",
    "pharmacyFeature1": "<strong>UI Development:</strong> Δημιούργησα ένα πλήρως δηλωτικό και reactive UI με το <strong>Jetpack Compose</strong>, για ένα σύγχρονο, διαισθητικό και συντηρήσιμο περιβάλλον χωρίς XML.",
    "pharmacyFeature2": "<strong>Αρχιτεκτονική:</strong> Εφάρμοσα στιβαρή <strong>MVVM</strong> αρχιτεκτονική με <strong>Kotlin Coroutines και Flow</strong>, διασφαλίζοντας σαφή διαχωρισμό αρμοδιοτήτων και επεκτασιμότητα του κώδικα.",
    "pharmacyFeature3": "<strong>Backend & Real-time:</strong> Ενσωμάτωσα <strong>Firebase Authentication</strong> για ασφαλή διαχείριση χρηστών και <strong>Cloud Firestore</strong> για real-time συγχρονισμό φαρμακείων και αγαπημένων.",
    "pharmacyFeature4": "<strong>Localization:</strong> Υλοποίησα πολυγλωσσική υποστήριξη (Ελληνικά/Αγγλικά) με δυνατότητα δυναμικής αλλαγής γλώσσας για μια πλήρως τοπική εμπειρία.",
    "pharmacyFeature5": "<strong>User Experience:</strong> Σχεδίασα light/dark mode και ενσωμάτωσα <strong>OpenStreetMap (OSM)</strong> με δυναμικά φίλτρα για ακτίνα αναζήτησης και κατάσταση εφημερίας.",
    "viewOnGithub": "Δείτε στο GitHub",
    "otherProjectsTitle": "Άλλα Έργα",
    "contactTitle": "Επικοινωνία",
    "contactText": "Είμαι πάντα ανοιχτός σε νέες συνεργασίες και ευκαιρίες.",
    "contactButton": "Στείλτε μου Email",
    "footerRights": "Με επιφύλαξη παντός δικαιώματος.",
    "resumeSectionTitle": "Βιογραφικό",
    "viewResumeBtn": "Προβολή Βιογραφικού",
    "downloadButton": "Λήψη PDF"
}
