{
    "title": "Κλέαρχος Χιούμπης - Software Developer",
    "navSummary": "Περίληψη",
    "navSkills": "Δεξιότητες",
    "navFeatured": "Projects",
    "navOther": "Άλλα Projects",
    "navResume": "Βιογραφικό",
    "navContact": "Επικοινωνία",
    "heroTitle": "Κλέαρχος Ξλιούμπης",
    "heroSubtitle": "Software Developer | Android & Backend Enthusiast",
    "githubButton": "Δείτε το GitHub μου",
    "summaryTitle": "Περίληψη",
    "summaryText": "Ενθουσιώδης Software Developer, αυτή τη στιγμή στο πρώτο έτος του διετούς προγράμματος Backend Development στο <strong>IEK DELTA 360</strong>. Διαθέτω ισχυρά θεμέλια στην ανάπτυξη Android με Kotlin και Jetpack Compose, και έντονο ενδιαφέρον για τη δημιουργία στιβαρών backend συστημάτων. Είμαι παθιασμένος με την εκμάθηση νέων τεχνολογιών, την επίλυση σύνθετων προβλημάτων και τη συμβολή σε καινοτόμα έργα λογισμικού.",
    "motivationTitle": "Το Κίνητρό μου",
    "motivationText": "Επέλεξα τον προγραμματισμό από ένα βαθύ πάθος για την επίλυση προβλημάτων και τη δημιουργία. Η ικανότητα να μετατρέπω μια ιδέα σε μια λειτουργική, απτή εφαρμογή που μπορεί να βοηθήσει ή να ψυχαγωγήσει τους ανθρώπους είναι αυτό που με οδηγεί. Ευδοκιμώ στην πρόκληση του debugging, της βελτιστοποίησης και της δημιουργίας κομψών λύσεων, και αναζητώ συνεχώς να επεκτείνω τις γνώσεις και τις δεξιότητές μου στον συνεχώς εξελισσόμενο κόσμο της ανάπτυξης λογισμικού.",
    "skillsTitle": "Δεξιότητες & Ικανότητες",
    "skillsSubLanguages": "Γλώσσες & Frameworks",
    "skillsSubIDEs": "IDEs",
    "skillsSubTools": "Εργαλεία Ανάπτυξης",
    "projectsTitle": "Προβεβλημένα Έργα",
    "nexusSubtitle": "ContextNexus",
    "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό, in-editor C++ plugin που λειτουργεί ως ειδικός pair programmer για τους Unreal developers. Λύνει το κρίσιμο πρόβλημα της επανάληψης του context εκτελώντας μια βαθιά ανάλυση του C++ και Blueprint κώδικα ενός project, επιτρέποντας στους developers να κάνουν σύνθετες ερωτήσεις σε μια AI που έχει μια τέλεια, ελάχιστη και σχετική κατανόηση της δουλειάς τους.",
    "nexusKeyFeatures": "Βασικές Συνεισφορές & Αρμοδιότητες:",
    "nexusFeatureFull1": "Ανέπτυξα και βελτίωσα τον πυρήνα της μηχανής ανάλυσης C++, επιτρέποντας στο εργαλείο να αναλύει και να κατανοεί ολόκληρο τον πηγαίο κώδικα C++ ενός project.",
    "nexusFeatureFull2": "Σχεδίασα και υλοποίησα βασικά στοιχεία του UI χρησιμοποιώντας το Slate UI framework, συμπεριλαμβανομένου του 'Project Explorer' και του ενσωματωμένου AI chat panel.",
    "nexusFeatureFull3": "Επέλυσα κρίσιμα σφάλματα μεταγλώττισης C++, linker errors και σφάλματα διαφθοράς μνήμης για να διασφαλίσω τη σταθερότητα και την αξιοπιστία του plugin.",
    "nexusFeatureFull4": "Ενσωμάτωσα το plugin απευθείας στον Content Browser του Unreal Editor, δημιουργώντας μια απρόσκοπτη ροή εργασίας για τους developers.",
    "nexusFeatureFull5": "Βελτίωσα την κατανόηση της AI υλοποιώντας σημασιολογική ανάλυση των Blueprint graphs και μια προσαρμοσμένη Domain-Specific Language (DSL).",
    "viewLiveSite": "Δείτε το Site",
    "pharmacyTitle": "E-Efimerevon",
    "pharmacySubtitle": "Σύγχρονη Android Εφαρμογή για Εφημερεύοντα Φαρμακεία",
    "pharmacyDescription": "Μια native εφαρμογή Android σχεδιασμένη για να λύσει το κρίσιμο πρόβλημα της εύρεσης εφημερεύοντων φαρμακείων στην Ελλάδα. Χτισμένη εξ ολοκλήρου από την αρχή με μια σύγχρονη τεχνολογική στοίβα που περιλαμβάνει <strong>Kotlin</strong>, <strong>Jetpack Compose</strong> και <strong>Firebase</strong>, προσφέρει μια καθαρή, γρήγορη και ανθρωποκεντρική εμπειρία.",
    "pharmacyKeyFeatures": "Κύριες Συνεισφορές & Τεχνικά Σημεία:",
    "pharmacyFeature1": "<strong>Ανάπτυξη UI:</strong> Αρχιτεκτόνησα ένα πλήρως δηλωτικό και reactive UI χρησιμοποιώντας το <strong>Jetpack Compose</strong>, με αποτέλεσμα ένα σύγχρονο, διαισθητικό και συντηρήσιμο περιβάλλον χρήστη χωρίς ούτε μία γραμμή XML.",
    "pharmacyFeature2": "<strong>Αρχιτεκτονική Λογισμικού:</strong> Υλοποίησα μια στιβαρή αρχιτεκτονική <strong>MVVM (Model-View-ViewModel)</strong> σε συνδυασμό με <strong>Kotlin Coroutines και Flow</strong>, δημιουργώντας έναν σαφή διαχωρισμό αρμοδιοτήτων που καθιστά τη βάση κώδικα επεκτάσιμη, σταθερή και εύκολα ελέγξιμη.",
    "pharmacyFeature3": "<strong>Backend & Δεδομένα σε Πραγματικό Χρόνο:</strong> Ενσωμάτωσα το <strong>Firebase Authentication</strong> για ένα πλήρες και ασφαλές σύστημα διαχείρισης χρηστών και αξιοποίησα το <strong>Cloud Firestore</strong> για τις δυνατότητες πραγματικού χρόνου, εξασφαλίζοντας ότι η κατάσταση των φαρμακείων και τα αγαπημένα των χρηστών είναι πάντα τέλεια συγχρονισμένα.",
    "pharmacyFeature4": "<strong>Localization:</strong> Κατασκεύασα end-to-end πολυγλωσσική υποστήριξη για Αγγλικά και Ελληνικά, επιτρέποντας στους χρήστες να αλλάζουν γλώσσα δυναμικά για μια πλήρως τοπική εμπειρία.",
    "pharmacyFeature5": "<strong>Εμπειρία Χρήστη:</strong> Σχεδίασα ένα απρόσκοπτο σύστημα θέματος light/dark mode και ενσωμάτωσα το <strong>OpenStreetMap (OSM)</strong> για μια αποτελεσματική, δωρεάν λύση χαρτογράφησης, πλήρη με δυναμικά φίλτρα για αναζήτηση ακτίνας και κατάσταση εφημερίας.",
    "viewOnGithub": "Δείτε στο GitHub",
    "otherProjectsTitle": "Άλλα Έργα",
    "contactTitle": "Επικοινωνήστε Μαζί Μου",
    "contactText": "Είμαι πάντα ανοιχτός να συζητήσω νέα έργα και ευκαιρίες.",
    "contactButton": "Στείλτε μου Email",
    "footerRights": "Με επιφύλαξη παντός δικαιώματος.",
    "resumeSectionTitle": "Βιογραφικό",
    "viewResumeBtn": "Προβολή Βιογραφικού",
    "downloadButton": "Λήψη PDF"
}
