{
    "title": "Κλέαρχος Χιούμπης - Software Developer",
    "navSummary": "Περίληψη",
    "navSkills": "Δεξιότητες",
    "navFeatured": "Έργα",
    "navOther": "Άλλα Έργα",
    "navResume": "Βιογραφικό",
    "navCertifications": "Πιστοποιήσεις",
    "navContact": "Επικοινωνία",
    "heroTitle": "Κλέαρχος Ξλιούμπης",
    "heroSubtitle": "Software Developer | Android & Backend Enthusiast",
    "typewriterPhrase1": "Android Developer.",
    "typewriterPhrase2": "Backend Enthusiast.",
    "typewriterPhrase3": "Δημιουργικός Επιλυτής Προβλημάτων.",
    "githubButton": "Δείτε το GitHub μου",
    "summaryTitle": "Περίληψη",
    "summaryText": "Ένας αφοσιωμένος και παθιασμένος Software Developer που αυτή τη στιγμή τελειοποιεί τις δεξιότητές του στο πρόγραμμα Τεχνικός Εφαρμογών Πληροφορικής στο <strong>IEK DELTA 360</strong>. Με ισχυρή εστίαση τόσο στην ανάπτυξη native <strong>Android εφαρμογών</strong> με Kotlin και Jetpack Compose, όσο και με αυξανόμενη εξειδίκευση σε <strong>Backend συστήματα</strong>, γεφυρώνω το χάσμα μεταξύ των εφαρμογών που βλέπει ο χρήστης και της στιβαρής λογικής στην πλευρά του server. Πιστεύω ακράδαντα στις αρχές του agile, δίνοντας έμφαση στη συνεργασία, την ευελιξία και τη συνεχή βελτίωση σε κάθε έργο που αναλαμβάνω. Η προσέγγισή μου καθορίζεται από τη δέσμευση για δια βίου μάθηση, την οποία επιδιώκω ενεργά μέσω πρακτικών προσωπικών έργων που μου επιτρέπουν να εξερευνώ νέες τεχνολογίες και να βελτιώνω τις ικανότητές μου στην επίλυση προβλημάτων. Έχω ως κίνητρο την πρόκληση της μετατροπής σύνθετων ιδεών σε κομψό, λειτουργικό λογισμικό και είμαι πρόθυμος να συνεισφέρω τις δεξιότητές μου σε καινοτόμα και ουσιαστικά έργα.",
    "motivationTitle": "Το Κίνητρό μου",
    "motivationText": "Το ταξίδι μου στον προγραμματισμό ξεκίνησε από την παιδική ηλικία, τροφοδοτούμενο από ένα βαθύ πάθος για την τεχνολογία και τη δημιουργική διαδικασία. Αυτό που με παρακινεί είναι η βαθιά ικανοποίηση του να μετατρέπω μια αφηρημένη ιδέα σε μια απτή, διαδραστική εφαρμογή που μπορεί να λύσει ένα πραγματικό πρόβλημα, να παρέχει μια υπηρεσία ή απλώς να προσφέρει χαρά σε έναν χρήστη. Ευδοκιμώ στην πνευματική πρόκληση της ανάπτυξης λογισμικού—από τη σχεδίαση ενός καθαρού και επεκτάσιμου συστήματος μέχρι τον σχολαστικό εντοπισμό σφαλμάτων και τη βελτιστοποίηση του κώδικα για μέγιστη απόδοση. Αυτός ο κύκλος ανάλυσης, δημιουργίας και βελτίωσης δεν είναι απλώς μια διαδικασία, αλλά μια τέχνη στην οποία είμαι αφοσιωμένος να τελειοποιήσω. Η εξερεύνηση γλωσσών όπως η Kotlin και η Java εδραίωσε το ενδιαφέρον μου, καθώς μου παρείχαν τα ισχυρά εργαλεία που χρειαζόμουν για να δημιουργήσω τις εξελιγμένες εφαρμογές που οραματιζόμουν. Τελικά, το κίνητρό μου είναι να αξιοποιώ την τεχνολογία για να χτίζω κομψές λύσεις και να συμβάλλω ουσιαστικά στο συνεχώς εξελισσόμενο ψηφιακό τοπίο.",
    "skillsTitle": "Δεξιότητες & Ικανότητες",
    "skillsSubLanguages": "Γλώσσες & Frameworks",
    "skillsSubIDEs": "IDEs",
    "skillsSubTools": "Εργαλεία Ανάπτυξης",
    "projectsTitle": "Προβεβλημένα Έργα",
    "nexusSubtitle": "ContextNexus",
    "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό, in-editor C++ plugin που λειτουργεί ως ειδικός pair programmer για τους Unreal developers. Λύνει το κρίσιμο πρόβλημα της επανάληψης του context εκτελώντας μια βαθιά ανάλυση του C++ και Blueprint κώδικα ενός project, επιτρέποντας στους developers να κάνουν σύνθετες ερωτήσεις σε μια AI που έχει μια τέλεια, ελάχιστη και σχετική κατανόηση της δουλειάς τους.",
    "nexusKeyFeatures": "Βασικές Συνεισφορές & Αρμοδιότητες:",
    "nexusFeatureFull1": "Ανέπτυξα και βελτίωσα τον πυρήνα της μηχανής ανάλυσης C++, επιτρέποντας στο εργαλείο να αναλύει και να κατανοεί ολόκληρο τον πηγαίο κώδικα C++ ενός project.",
    "nexusFeatureFull2": "Σχεδίασα και υλοποίησα βασικά στοιχεία του UI χρησιμοποιώντας το Slate UI framework, συμπεριλαμβανομένου του 'Project Explorer' και του ενσωματωμένου AI chat panel.",
    "nexusFeatureFull3": "Επέλυσα κρίσιμα σφάλματα μεταγλώττισης C++, linker errors και σφάλματα διαφθοράς μνήμης για να διασφαλίσω τη σταθερότητα και την αξιοπιστία του plugin.",
    "nexusFeatureFull4": "Ενσωμάτωσα το plugin απευθείας στον Content Browser του Unreal Editor, δημιουργώντας μια απρόσκοπτη ροή εργασίας για τους developers.",
    "nexusFeatureFull5": "Βελτίωσα την κατανόηση της AI υλοποιώντας σημασιολογική ανάλυση των Blueprint graphs και μια προσαρμοσμένη Domain-Specific Language (DSL).",
    "viewLiveSite": "Δείτε το Site",
    "pharmacyTitle": "E-Efimerevon",
    "pharmacySubtitle": "Σύγχρονη Android Εφαρμογή για Εφημερεύοντα Φαρμακεία",
    "pharmacyDescription": "Μια native Android εφαρμογή σχεδιασμένη για να βοηθά τους χρήστες στην Ελλάδα να εντοπίζουν άμεσα τα εφημερεύοντα φαρμακεία. Χτισμένη εξ ολοκλήρου με σύγχρονες τεχνολογίες όπως Kotlin, Jetpack Compose και Firebase, προσφέρει μια καθαρή, γρήγορη και φιλική προς το χρήστη εμπειρία.",
    "pharmacyKeyFeatures": "Βασικά Χαρακτηριστικά & Συνεισφορές:",
    "pharmacyFeature1": "Ανέπτυξα ένα ρευστό και διαισθητικό UI από την αρχή χρησιμοποιώντας το Jetpack Compose, εστιάζοντας σε μια καθαρή και προσιτή εμπειρία χρήστη.",
    "pharmacyFeature2": "Υλοποίησα μια καθαρή αρχιτεκτονική MVVM για να διασφαλίσω έναν κώδικα που είναι επεκτάσιμος, συντηρήσιμος και ελέγξιμος.",
    "pharmacyFeature3": "Ενσωμάτωσα το Firebase & Firestore για συγχρονισμό δεδομένων σε πραγματικό χρόνο, διασφαλίζοντας ότι οι χρήστες έχουν πάντα τις πιο ενημερωμένες πληροφορίες φαρμακείων.",
    "pharmacyFeature4": "Πρόσθεσα πλήρη πολυγλωσσική υποστήριξη τόσο για τα Αγγλικά όσο και για τα Ελληνικά.",
    "pharmacyFeature5": "Σχεδίασα ένα δυναμικό σύστημα θέματος για μια απρόσκοπτη εμπειρία light/dark mode.",
    "viewOnGithub": "Δείτε στο GitHub",
    "otherProjectsTitle": "Άλλα Έργα",
    "resumeSectionTitle": "Βιογραφικό",
    "viewResumeBtn": "Προβολή Βιογραφικού",
    "hideResumeBtn": "Απόκρυψη Βιογραφικού",
    "downloadButton": "Λήψη PDF",
    "certificationsTitle": "Πιστοποιήσεις",
    "contactTitle": "Επικοινωνήστε Μαζί Μου",
    "contactText": "Είμαι πάντα ανοιχτός να συζητήσω νέα έργα και ευκαιρίες.",
    "contactButton": "Στείλτε μου Email",
    "footerRights": "Με επιφύλαξη παντός δικαιώματος."
}
