{
  "title": "Κλέαρχος Ξλιούμπης - Software Developer",
  "heroTitle": "Κλέαρχος Ξλιούμπης",
  "heroSubtitle": "Ενθουσιώδης Software Developer | Ειδικός σε Android & Kotlin",
  "githubButton": "Δείτε το GitHub μου",
  "summaryTitle": "Σύνοψη",
  "summaryText": "Ενθουσιώδης Software Developer, αυτή τη στιγμή στον πρώτο από τα δύο έτη του προγράμματος Backend Development στο <strong>ΙΕΚ ΔΕΛΤΑ 360</strong>. Με ισχυρές βάσεις και πρακτική εμπειρία στην ανάπτυξη με Kotlin και Android, είμαι πρόθυμος να συνεισφέρω σε πραγματικά projects, να εξελιχθώ σε μια συνεργατική ομάδα και να δημιουργήσω επεκτάσιμες, καθαρές λύσεις κώδικα.",
  "motivationTitle": "Το Κίνητρό μου",
  "motivationText": "Επέλεξα τον προγραμματισμό από ένα βαθύ πάθος για την επίλυση προβλημάτων και τη δημιουργία. Η ικανότητα να μετατρέπεις μια αφηρημένη ιδέα σε μια απτή, λειτουργική εφαρμογή είναι απίστευτα ανταποδοτική. Επικεντρώθηκα ειδικά στην <strong>Ανάπτυξη Android</strong> λόγω του άμεσου αντίκτυπου στην καθημερινότητα εκατομμυρίων χρηστών. Με ωθεί η πρόκληση της δημιουργίας διαισθητικών, υψηλής απόδοσης εμπειριών σε μια πλατφόρμα που εξελίσσεται συνεχώς, χρησιμοποιώντας ισχυρές γλώσσες όπως η Kotlin για τη συγγραφή καθαρού και αποδοτικού κώδικα.",
  "skillsTitle": "Δεξιότητες",
  "projectsTitle": "Κύρια Projects",
  "pharmacySubtitle": "Σύγχρονη Εφαρμογή Android για Εφημερεύοντα Φαρμακεία",
  "pharmacyDescription": "Μια native Android εφαρμογή σχεδιασμένη για να βοηθά τους χρήστες να βρίσκουν άμεσα τα εφημερεύοντα φαρμακεία. Η εφαρμογή είναι χτισμένη με σύγχρονες τεχνολογίες με έμφαση στην καθαρή αρχιτεκτονική και ένα ρευστό, responsive user interface. Λειτουργεί ως ένα πρακτικό εργαλείο για καθημερινή χρήση, αναδεικνύοντας δεξιότητες στην ανάπτυξη mobile εφαρμογών, τον χειρισμό δεδομένων σε πραγματικό χρόνο και τον σχεδιασμό με επίκεντρο τον χρήστη.",
  "pharmacyKeyFeatures": "Κύρια Χαρακτηριστικά & Συνεισφορά:",
  "pharmacyFeature1": "Ανάπτυξη ενός ρευστού και διαισθητικού UI από την αρχή με χρήση του Jetpack Compose.",
  "pharmacyFeature2": "Εφαρμογή καθαρής αρχιτεκτονικής MVVM για έναν επεκτάσιμο και συντηρήσιμο κώδικα.",
  "pharmacyFeature3": "Ενσωμάτωση Firebase & Firestore για συγχρονισμό δεδομένων σε πραγματικό χρόνο.",
  "pharmacyFeature4": "Προσθήκη πλήρους πολυγλωσσικής υποστήριξης για Αγγλικά και Ελληνικά.",
  "pharmacyFeature5": "Υλοποίηση ενός δυναμικού συστήματος θέματος για απρόσκοπτη εναλλαγή light/dark mode.",
  "nexusSubtitle": "AI Co-Pilot για την Unreal Engine 5",
  "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό C++ plugin μέσα στον editor, το οποίο λειτουργεί ως ένας έμπειρος pair programmer για τους Unreal developers. Λύνει το κρίσιμο πρόβλημα της επανάληψης του context, εκτελώντας μια βαθιά ανάλυση του C++ και Blueprint κώδικα ενός project, επιτρέποντας στους developers να κάνουν σύνθετες ερωτήσεις σε μια AI που έχει μια τέλεια, ελάχιστη και σχετική κατανόηση της δουλειάς τους.",
  "nexusKeyFeatures": "Βασικές Συνεισφορές & Αρμοδιότητες:",
  "nexusFeatureFull1": "Ανάπτυξη και βελτίωση της κεντρικής μηχανής ανάλυσης C++, επιτρέποντας στο εργαλείο να αναλύει και να κατανοεί ολόκληρο τον C++ κώδικα ενός project.",
  "nexusFeatureFull2": "Αρχιτεκτονική και υλοποίηση βασικών στοιχείων UI με χρήση του Slate UI framework, συμπεριλαμβανομένου του \"Project Explorer\" και του ενσωματωμένου AI chat panel.",
  "nexusFeatureFull3": "Επίλυση κρίσιμων σφαλμάτων C++ compilation, linker errors, και memory corruption για τη διασφάλιση της σταθερότητας και αξιοπιστίας του plugin.",
  "nexusFeatureFull4": "Ενσωμάτωση του plugin απευθείας στον Content Browser του Unreal Editor, δημιουργώντας μια απρόσκοπτη ροή εργασίας για τους developers.",
  "nexusFeatureFull5": "Βελτίωση της κατανόησης της AI μέσω της εφαρμογής σημασιολογικής ανάλυσης των Blueprint graphs και μιας προσαρμοσμένης Γλώσσας Ειδικού Τομέα (DSL).",
  "otherProjectsTitle": "Άλλα Projects",
  "contactTitle": "Επικοινωνήστε Μαζί μου",
  "contactText": "Είμαι πάντα ανοιχτός για να συζητήσω νέα projects και ευκαιρίες.",
  "contactButton": "Στείλτε Email",
  "footerRights": "Με επιφύλαξη παντός δικαιώματος.",
  "viewLiveSite": "Δείτε το Site",
  "viewOnGithub": "Δείτε στο GitHub"
}