{
    "title": "Κλέαρχος Χλιούμπης - Software Developer",
    "navSummary": "Περίληψη",
    "navSkills": "Δεξιότητες",
    "navFeatured": "Έργα",
    "navOther": "Άλλα Έργα",
    "navResume": "Βιογραφικό",
    "navContact": "Επικοινωνία",
    "heroTitle": "Κλέαρχος Χλιούμπης",
    "heroSubtitle": "Software Developer | Android & Backend Enthusiast",
    "typewriterPhrase1": "Android Developer.",
    "typewriterPhrase2": "Backend Enthusiast.",
    "typewriterPhrase3": "Δημιουργικός Επιλυτής Προβλημάτων.",
    "githubButton": "Δείτε το GitHub μου",
    "summaryTitle": "Περίληψη",
    "summaryText": "Ενθουσιώδης Software Developer, αυτή τη στιγμή στο πρώτο έτος του διετούς προγράμματος Backend Development στο <strong>IEK DELTA 360</strong>. Διαθέτω ισχυρά θεμέλια στην ανάπτυξη Android με Kotlin και Jetpack Compose, και έντονο ενδιαφέρον για τη δημιουργία στιβαρών backend συστημάτων. Είμαι παθιασμένος με την εκμάθηση νέων τεχνολογιών, την επίλυση σύνθετων προβλημάτων και τη συμβολή σε καινοτόμα έργα λογισμικού.",
    "motivationTitle": "Το Κίνητρό μου",
    "motivationText": "Επέλεξα τον προγραμματισμό από ένα βαθύ πάθος για την επίλυση προβλημάτων και τη δημιουργία. Η ικανότητα να μετατρέπω μια ιδέα σε μια λειτουργική, απτή εφαρμογή που μπορεί να βοηθήσει ή να ψυχαγωγήσει τους ανθρώπους είναι αυτό που με οδηγεί. Ευδοκιμώ στην πρόκληση του debugging, της βελτιστοποίησης και της δημιουργίας κομψών λύσεων, και αναζητώ συνεχώς να επεκτείνω τις γνώσεις και τις δεξιότητές μου στον συνεχώς εξελισσόμενο κόσμο της ανάπτυξης λογισμικού.",
    "skillsTitle": "Δεξιότητες & Ικανότητες",
    "skillsSubLanguages": "Γλώσσες & Frameworks",
    "skillsSubIDEs": "IDEs",
    "skillsSubTools": "Εργαλεία Ανάπτυξης",
    "projectsTitle": "Προβεβλημένα Έργα",
    "nexusSubtitle": "ContextNexus",
    "nexusDescription": "Το Context Nexus είναι ένα επαγγελματικό, in-editor C++ plugin που λειτουργεί ως ειδικός pair programmer για τους Unreal developers. Λύνει το κρίσιμο πρόβλημα της επανάληψης του context εκτελώντας μια βαθιά ανάλυση του C++ και Blueprint κώδικα ενός project, επιτρέποντας στους developers να κάνουν σύνθετες ερωτήσεις σε μια AI που έχει μια τέλεια, ελάχιστη και σχετική κατανόηση της δουλειάς τους.",
    "nexusKeyFeatures": "Βασικές Συνεισφορές & Αρμοδιότητες:",
    "nexusFeatureFull1": "Ανέπτυξα και βελτίωσα τον πυρήνα της μηχανής ανάλυσης C++, επιτρέποντας στο εργαλείο να αναλύει και να κατανοεί ολόκληρο τον πηγαίο κώδικα C++ ενός project.",
    "nexusFeatureFull2": "Σχεδίασα και υλοποίησα βασικά στοιχεία του UI χρησιμοποιώντας το Slate UI framework, συμπεριλαμβανομένου του 'Project Explorer' και του ενσωματωμένου AI chat panel.",
    "nexusFeatureFull3": "Επέλυσα κρίσιμα σφάλματα μεταγλώττισης C++, linker errors και σφάλματα διαφθοράς μνήμης για να διασφαλίσω τη σταθερότητα και την αξιοπιστία του plugin.",
    "nexusFeatureFull4": "Ενσωμάτωσα το plugin απευθείας στον Content Browser του Unreal Editor, δημιουργώντας μια απρόσκοπτη ροή εργασίας για τους developers.",
    "nexusFeatureFull5": "Βελτίωσα την κατανόηση της AI υλοποιώντας σημασιολογική ανάλυση των Blueprint graphs και μια προσαρμοσμένη Domain-Specific Language (DSL).",
    "viewLiveSite": "Δείτε το Site",
    "pharmacyTitle": "E-Efimerevon",
    "pharmacySubtitle": "Σύγχρονη Android Εφαρμογή για Εφημερεύοντα Φαρμακεία",
    "pharmacyDescription": "Μια native Android εφαρμογή σχεδιασμένη για να βοηθά τους χρήστες στην Ελλάδα να εντοπίζουν άμεσα τα εφημερεύοντα φαρμακεία. Χτισμένη εξ ολοκλήρου με σύγχρονες τεχνολογίες όπως Kotlin, Jetpack Compose και Firebase, προσφέρει μια καθαρή, γρήγορη και φιλική προς το χρήστη εμπειρία.",
    "pharmacyKeyFeatures": "Βασικά Χαρακτηριστικά & Συνεισφορές:",
    "pharmacyFeature1": "Ανέπτυξα ένα ρευστό και διαισθητικό UI από την αρχή χρησιμοποιώντας το Jetpack Compose, εστιάζοντας σε μια καθαρή και προσιτή εμπειρία χρήστη.",
    "pharmacyFeature2": "Υλοποίησα μια καθαρή αρχιτεκτονική MVVM για να διασφαλίσω έναν κώδικα που είναι επεκτάσιμος, συντηρήσιμος και ελέγξιμος.",
    "pharmacyFeature3": "Ενσωμάτωσα το Firebase & Firestore για συγχρονισμό δεδομένων σε πραγματικό χρόνο, διασφαλίζοντας ότι οι χρήστες έχουν πάντα τις πιο ενημερωμένες πληροφορίες φαρμακείων.",
    "pharmacyFeature4": "Πρόσθεσα πλήρη πολυγλωσσική υποστήριξη τόσο για τα Αγγλικά όσο και για τα Ελληνικά.",
    "pharmacyFeature5": "Σχεδίασα ένα δυναμικό σύστημα θέματος για μια απρόσκοπτη εμπειρία light/dark mode.",
    "viewOnGithub": "Δείτε στο GitHub",
    "otherProjectsTitle": "Άλλα Έργα",
    "contactTitle": "Επικοινωνήστε Μαζί Μου",
    "contactText": "Είμαι πάντα ανοιχτός να συζητήσω νέα έργα και ευκαιρίες.",
    "contactButton": "Στείλτε μου Email",
    "footerRights": "Με επιφύλαξη παντός δικαιώματος.",
    "resumeSectionTitle": "Βιογραφικό",
    "viewResumeBtn": "Προβολή Βιογραφικού",
    "hideResumeBtn": "Απόκρυψη Βιογραφικού",
    "downloadButton": "Λήψη PDF"
}
